app/controllers/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def authenticate_request
    token = request.headers['Authorization']&.split(' ')&.last
    puts "Received Token: #{token}" # Log the token to verify

    decoded_token = decode_jwt(token)
    @current_user = User.find(decoded_token[:user_id]) if decoded_token