app/controllers/discount_codes_controller.rb

    def discount_codes_by_event
      @discount_codes = DiscountCode.where(event_id: params[:event_id])

      if @discount_codes.present?
---
SELECT "discount_codes".* FROM "discount_codes" WHERE "discount_codes"."event_id" = 7
SELECT 1 AS one FROM "discount_codes" WHERE "discount_codes"."code" = 'AbC123dEf' LIMIT 1

    def discount_codes_by_user
      @discount_codes = DiscountCode.where(user_id: params[:user_id])

      if @discount_codes.present?
---
SELECT "discount_codes".* FROM "discount_codes" WHERE "discount_codes"."user_id" = NULL
SELECT 1 AS one FROM "discount_codes" WHERE "discount_codes"."code" = 'AbC123dEf' AND "discount_codes"."id" != 1 LIMIT 1

    def index
      @discount_codes = DiscountCode.all
---
SELECT "discount_codes".* FROM "discount_codes"

    def create
      @discount_code = DiscountCode.new(discount_code_params)

      if @discount_code.save
---
INSERT INTO "discount_codes" ("code", "discount_percentage", "start_date", "end_date", "max_uses", "used_count", "status", "event_id", "user_id", "created_at", "updated_at") VALUES ('EVENT2025', 20, '2025-04-01 00:00:00', '2025-04-30 23:59:59', 100, 0, 'active', 19, 24, '2025-04-30 08:23:20.141025', '2025-04-30 08:23:20.141025') RETURNING "id"

    def update
      if @discount_code.update(discount_code_params)
---
UPDATE "discount_codes" SET "status" = 'Inactive', "updated_at" = '2025-04-28 09:57:31.368496' WHERE "discount_codes"."id" = 1

    def destroy
      if @discount_code.destroy
---
DELETE FROM "discount_codes" WHERE "discount_codes"."id" = 1

    def set_discount_code
      @discount_code = DiscountCode.find(params[:id])
---
SELECT "discount_codes".* FROM "discount_codes" WHERE "discount_codes"."id" = 1 LIMIT 1