app/controllers/events_controller.rb

    def create
      @event = Event.new(event_params)
      if @event.save
---
INSERT INTO "events" ("organizer_name", "event_name", "description", "event_date", "event_end_date", "start_time", "end_time", "capacity", "registered_count", "base_price", "early_bird_price", "early_bird_end_time", "status", "user_id", "venue_id", "event_type_id", "created_at", "updated_at") VALUES ('John Doe', 'Tech Conference 2025', 'A conference for tech enthusiasts', '2025-06-01 09:00:00', '2025-06-01 17:00:00', '2025-06-01 09:00:00', '2025-06-01 17:00:00', 200, 0, 100, 80, '2025-05-15 23:59:59', 'upcoming', 6, 1, 2, '2025-04-28 07:11:01.305925', '2025-04-28 07:11:01.305925') RETURNING "id"

    def index_by_user
      @events = Event.where(user_id: params[:user_id])

      if @events.any?
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 6
SELECT "events".* FROM "events" WHERE "events"."user_id" = 24
SELECT 1 AS one FROM "events" WHERE "events"."user_id" = 24 LIMIT 1

    def destroy
      if @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = 19