app/controllers/event_types_controller.rb

SELECT "event_types".* FROM "event_types"
---
  def index
    @event_types = EventType.all

INSERT INTO "event_types" ("event_type_name", "created_at", "updated_at") VALUES ('Workshop', '2025-04-27 15:51:46.275506', '2025-04-27 15:51:46.275506') RETURNING "id"
---
  def create
    @event_type = EventType.new(event_type_params)
    if @event_type.save