app/controllers/event_bookings_controller.rb

  def create
    @event_booking = EventBooking.new(event_booking_params)

    if @event_booking.save
      @event_booking.payments.create(
        total_amount: @event_booking.total_price,
        payment_status: 'in_process',
        payment_date: Time.current
      )
---
INSERT INTO "event_bookings" ("user_id", "event_id", "number_of_tickets", "status", "booking_date", "created_at", "updated_at", "total_price") VALUES (23, 2, 3, 'pending', '2025-04-30 09:14:41.172228', '2025-04-30 09:14:41.176366', '2025-04-30 09:14:41.176366', 240.0) RETURNING "id"
INSERT INTO "payments" ("event_booking_id", "total_amount", "payment_status", "payment_date", "created_at", "updated_at") VALUES (6, 240.0, 'in_process', '2025-04-30 09:14:41.184519', '2025-04-30 09:14:41.194252', '2025-04-30 09:14:41.194252') RETURNING "id"