app/controllers/payments_controller.rb

SELECT "event_bookings".* FROM "event_bookings" WHERE "event_bookings"."id" = 5 LIMIT 1
UPDATE "events" SET "registered_count" = 3, "updated_at" = '2025-04-29 17:48:35.488262' WHERE "events"."id" = 2
UPDATE "event_bookings" SET "status" = 'confirmed', "updated_at" = '2025-04-29 17:48:35.452499' WHERE "event_bookings"."id" = 5
SELECT "payments".* FROM "payments" WHERE "payments"."event_booking_id" = 5 LIMIT 1
UPDATE "payments" SET "payment_status" = 'success', "payment_date" = '2025-04-29 17:48:35.466879', "updated_at" = '2025-04-29 17:48:35.469362' WHERE "payments"."id" = 2
SELECT "events".* FROM "events" WHERE "events"."id" = 2 LIMIT 1
---
    def payment_success_url
        if params[:payment_status] == "success"
         if params[:event_booking_id].present?
            @event_booking = EventBooking.find(params[:event_booking_id])
            @event_booking.update(status: "confirmed")
            @payment=Payment.find_by(event_booking_id: params[:event_booking_id])
            @payment.update(payment_status: "success", payment_date: Time.current)
            @number_of_tickets = @event_booking.number_of_tickets
            @event = Event.find(@event_booking.event_id)
            @event.update(registered_count: @event.registered_count + @number_of_tickets)