app/controllers/price_calculators_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = 16 LIMIT 1
---
  def total_price
    max_number_of_tickets = 4
    number_of_tickets = params[:number_of_tickets].to_i
    event = Event.find_by(id: params[:event_id])

SELECT "events".* FROM "events" WHERE "events"."id" = 16 LIMIT 1
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
---
  def early_bird_discount
    event = Event.find_by(id: params[:event_id])
    total_price = params[:total_price].to_f

    if event&.early_bird_end_time.present? && Time.current < event.early_bird_end_time

SELECT "discount_codes".* FROM "discount_codes" WHERE "discount_codes"."code" IS NULL LIMIT 1
---
  def apply_discount
    discount_code = DiscountCode.find_by(code: params[:code])