app/controllers/roles_controller.rb

INSERT INTO "roles" ("role_type", "created_at", "updated_at") VALUES ('Attende', '2025-04-22 07:07:47.852663', '2025-04-22 07:07:47.852663') RETURNING "id"
---
  def create
    @role = Role.new(role_params)
    if @role.save

UPDATE "roles" SET "role_type" = ?, "updated_at" = ? WHERE "roles"."id" = ?  [["role_type", "UpdatedRole"], ["updated_at", "2025-05-14 06:27:12.501348"], ["id", 1]]
---
  def update
    if @role.update(role_params)

DELETE FROM "roles" WHERE "roles"."id" = 2
---
  def destroy
    @role.destroy