app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "surname", "email", "phone_no", "password", "role_id", "created_at", "updated_at") VALUES ('Alice', 'Smith', 'alice@example.com', '1234567890', 'securePassword123', 2, '2025-04-22 10:45:48.777553', '2025-04-22 10:45:48.777553') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "first_name" = ?, "surname" = ?, "phone_no" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "UpdatedName"], ["surname", "UpdatedSurname"], ["phone_no", "0987654321"], ["password_digest", "[FILTERED]"], ["updated_at", "2025-05-13 09:25:39.166930"], ["id", 4]]
---
  def update
    if @user.update(update_user_params)

DELETE FROM "users" WHERE "users"."id" = 2
---
  def destroy
    if @user.destroy