app/controllers/venues_controller.rb

    def show
      @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = 2 LIMIT 1

    def create
      @venue = Venue.new(venue_params)
      if @venue.save
---
INSERT INTO "venues" ("venue_name", "address", "state", "country", "postal_code", "created_at", "updated_at") VALUES ('City Conference Center', '123 Main Street', 'California', 'USA', '90001', '2025-04-27 16:06:06.724678', '2025-04-27 16:06:06.724678') RETURNING "id"