app/models/event.rb

  def event_time_does_not_overlap
    overlapping_events = Event.where(venue_id: venue_id).where.not(id: id)

    overlapping_events.each do |event|
---
SELECT "events".* FROM "events" WHERE "events"."venue_id" = 2 AND "events"."id" IS NOT NULL